Catalogs/НоменклатураПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НоменклатураПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагАктуальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатураПрисоединенныеФайлы/Forms/ПрисоединенныеФайлы/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем мПредыдущийИдентификатор;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	 
	ВладелецФайла = Параметры.ВладелецФайла;
	ОсновноеИзображение = Параметры.ОсновноеИзображение;
	
	Если Параметры.ВладелецФайла.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Список прикрепленных файлов можно посмотреть только в форме объекта-владельца.'");
	КонецЕсли;
	
	Файлы.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ВладелецФайла);
	Файлы.Параметры.УстановитьЗначениеПараметра("ОсновноеИзображение", ОсновноеИзображение);
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Файлы.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = ТекущиеДанные.Ссылка.УникальныйИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = ТекущиеДанные.Ссылка.УникальныйИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	ОбщийМодульКлиент.ПредпросмотрФайла(ПоместитьДанныеВХранилище(ТекущиеДанные), Элементы.Файлы.ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФайл(Неопределено);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьФайл(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ТолькоИзображения, НоменклатураПрисоединенныеФайлы, ДействиеПослеПрикрепления", Истина, Истина, ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВладелецФайла, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(Элементы.Файлы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные =  Элементы.Файлы.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		АдресФайла = ПоместитьДанныеВХранилище(ТекущиеДанные);
		ВременноеИмя = ПолучитьИмяВременногоФайла(ТекущиеДанные.Расширение);
    	ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновным(Команда)
	
	ТекущиеДанные = Элементы.Файлы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ОсновноеИзображение = ТекущиеДанные.Ссылка;
	Если ОсновноеИзображение = ТекущиеДанные.Ссылка Тогда
		ОсновноеИзображение = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
	Иначе
	    ОсновноеИзображение = ТекущиеДанные.Ссылка;
	КонецЕсли;
		
	Оповестить("УстановкаОсновногоИзображенияТовара", ОсновноеИзображение);	
	Файлы.Параметры.УстановитьЗначениеПараметра("ОсновноеИзображение", ОсновноеИзображение);
	Элементы.Файлы.Обновить();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// выделение основного изображения жирным 		
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Файлы");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Файлы.Основное");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		Элементы.Файлы.Обновить();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилище(ТекущиеДанные)
	
	Возврат ПоместитьВоВременноеХранилище(ТекущиеДанные.Ссылка.ФайлХранилище.Получить(), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
